###############################################################################
# Created by write_sdc
# Fri Oct  1 19:49:43 2021
###############################################################################
current_design mgmt_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 50.0000 [get_ports {clock}]
set_propagated_clock [get_clocks {clock}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io0_di}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io1_di}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {gpio_in_pad}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[100]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[101]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[102]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[103]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[104]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[105]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[106]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[107]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[108]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[109]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[10]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[110]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[111]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[112]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[113]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[114]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[115]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[116]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[117]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[118]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[119]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[11]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[120]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[121]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[122]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[123]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[124]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[125]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[126]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[127]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[12]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[13]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[14]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[15]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[16]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[17]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[18]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[19]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[20]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[21]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[22]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[23]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[24]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[25]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[26]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[27]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[28]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[29]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[2]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[30]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[31]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[32]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[33]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[34]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[35]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[36]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[37]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[38]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[39]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[3]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[40]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[41]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[42]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[43]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[44]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[45]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[46]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[47]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[48]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[49]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[4]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[50]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[51]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[52]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[53]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[54]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[55]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[56]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[57]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[58]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[59]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[5]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[60]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[61]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[62]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[63]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[64]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[65]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[66]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[67]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[68]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[69]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[6]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[70]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[71]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[72]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[73]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[74]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[75]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[76]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[77]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[78]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[79]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[7]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[80]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[81]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[82]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[83]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[84]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[85]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[86]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[87]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[88]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[89]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[8]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[90]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[91]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[92]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[93]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[94]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[95]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[96]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[97]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[98]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[99]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_input[9]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[10]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[11]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[12]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[13]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[14]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[15]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[16]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[17]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[18]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[19]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[20]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[21]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[22]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[23]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[24]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[25]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[26]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[27]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[28]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[29]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[2]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[30]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[31]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[3]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[4]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[5]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[6]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[7]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[8]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mask_rev[9]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[10]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[11]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[12]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[13]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[14]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[15]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[16]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[17]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[18]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[19]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[20]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[21]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[22]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[23]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[24]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[25]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[26]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[27]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[28]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[29]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[2]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[30]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[31]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[32]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[33]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[34]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[35]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[36]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[37]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[3]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[4]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[5]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[6]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[7]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[8]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_in_data[9]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[10]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[11]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[12]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[13]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[14]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[15]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[16]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[17]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[18]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[19]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[20]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[21]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[22]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[23]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[24]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[25]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[26]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[27]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[28]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[29]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[2]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[30]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[31]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[32]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[33]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[34]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[35]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[36]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[37]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[38]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[39]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[3]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[40]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[41]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[42]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[43]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[44]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[45]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[46]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[47]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[48]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[49]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[4]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[50]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[51]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[52]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[53]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[54]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[55]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[56]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[57]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[58]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[59]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[5]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[60]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[61]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[62]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[63]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[6]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[7]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[8]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata[9]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[10]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[11]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[12]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[13]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[14]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[15]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[16]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[17]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[18]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[19]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[20]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[21]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[22]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[23]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[24]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[25]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[26]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[27]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[28]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[29]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[2]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[30]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[31]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[3]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[4]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[5]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[6]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[7]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[8]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_rdata_ro[9]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj2_vcc_pwrgood}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj2_vdd_pwrgood}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_ack_i}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[10]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[11]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[12]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[13]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[14]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[15]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[16]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[17]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[18]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[19]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[20]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[21]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[22]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[23]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[24]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[25]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[26]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[27]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[28]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[29]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[2]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[30]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[31]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[3]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[4]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[5]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[6]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[7]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[8]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_i[9]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_vcc_pwrgood}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_vdd_pwrgood}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {porb}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_irq[0]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_irq[1]}]
set_input_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_irq[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {core_clk}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {core_rstn}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_clk}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_clk_ieb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_clk_oeb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_csb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_csb_ieb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_csb_oeb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io0_do}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io0_ieb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io0_oeb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io1_do}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io1_ieb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io1_oeb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io2_oeb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {flash_io3_oeb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {gpio_inenb_pad}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {gpio_mode0_pad}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {gpio_mode1_pad}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {gpio_out_pad}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {gpio_outenb_pad}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {jtag_out}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {jtag_outenb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[100]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[101]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[102]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[103]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[104]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[105]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[106]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[107]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[108]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[109]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[110]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[111]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[112]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[113]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[114]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[115]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[116]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[117]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[118]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[119]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[120]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[121]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[122]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[123]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[124]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[125]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[126]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[127]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[32]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[33]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[34]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[35]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[36]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[37]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[38]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[39]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[40]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[41]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[42]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[43]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[44]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[45]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[46]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[47]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[48]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[49]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[50]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[51]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[52]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[53]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[54]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[55]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[56]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[57]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[58]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[59]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[60]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[61]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[62]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[63]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[64]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[65]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[66]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[67]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[68]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[69]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[70]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[71]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[72]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[73]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[74]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[75]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[76]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[77]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[78]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[79]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[80]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[81]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[82]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[83]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[84]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[85]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[86]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[87]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[88]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[89]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[90]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[91]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[92]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[93]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[94]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[95]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[96]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[97]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[98]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[99]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_iena[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[100]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[101]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[102]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[103]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[104]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[105]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[106]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[107]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[108]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[109]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[110]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[111]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[112]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[113]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[114]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[115]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[116]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[117]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[118]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[119]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[120]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[121]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[122]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[123]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[124]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[125]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[126]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[127]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[32]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[33]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[34]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[35]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[36]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[37]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[38]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[39]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[40]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[41]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[42]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[43]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[44]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[45]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[46]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[47]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[48]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[49]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[50]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[51]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[52]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[53]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[54]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[55]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[56]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[57]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[58]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[59]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[60]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[61]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[62]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[63]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[64]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[65]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[66]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[67]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[68]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[69]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[70]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[71]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[72]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[73]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[74]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[75]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[76]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[77]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[78]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[79]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[80]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[81]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[82]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[83]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[84]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[85]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[86]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[87]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[88]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[89]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[90]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[91]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[92]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[93]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[94]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[95]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[96]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[97]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[98]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[99]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_oenb[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[100]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[101]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[102]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[103]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[104]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[105]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[106]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[107]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[108]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[109]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[110]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[111]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[112]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[113]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[114]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[115]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[116]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[117]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[118]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[119]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[120]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[121]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[122]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[123]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[124]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[125]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[126]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[127]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[32]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[33]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[34]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[35]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[36]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[37]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[38]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[39]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[40]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[41]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[42]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[43]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[44]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[45]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[46]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[47]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[48]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[49]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[50]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[51]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[52]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[53]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[54]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[55]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[56]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[57]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[58]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[59]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[60]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[61]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[62]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[63]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[64]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[65]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[66]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[67]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[68]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[69]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[70]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[71]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[72]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[73]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[74]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[75]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[76]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[77]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[78]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[79]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[80]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[81]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[82]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[83]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[84]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[85]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[86]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[87]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[88]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[89]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[90]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[91]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[92]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[93]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[94]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[95]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[96]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[97]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[98]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[99]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {la_output[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_addr_ro[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_ena[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_ena[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_ena_ro}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[32]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[33]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[34]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[35]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[36]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[37]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_out_data[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wdata[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mgmt_wen_mask[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_adr_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_cyc_o}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[10]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[11]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[12]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[13]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[14]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[15]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[16]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[17]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[18]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[19]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[20]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[21]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[22]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[23]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[24]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[25]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[26]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[27]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[28]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[29]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[30]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[31]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[4]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[5]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[6]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[7]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[8]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_dat_o[9]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_io_loader_clock}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_io_loader_data_1}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_io_loader_data_2}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_io_loader_resetn}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_sel_o[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_sel_o[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_sel_o[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_sel_o[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_stb_o}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {mprj_we_o}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {pwr_ctrl_out[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {pwr_ctrl_out[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {pwr_ctrl_out[2]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {pwr_ctrl_out[3]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {sdo_out}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {sdo_outenb}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_clk}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_irq_ena[0]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_irq_ena[1]}]
set_output_delay 10.0000 -clock [get_clocks {clock}] -add_delay [get_ports {user_irq_ena[2]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0177 [get_ports {core_clk}]
set_load -pin_load 0.0177 [get_ports {core_rstn}]
set_load -pin_load 0.0177 [get_ports {flash_clk}]
set_load -pin_load 0.0177 [get_ports {flash_clk_ieb}]
set_load -pin_load 0.0177 [get_ports {flash_clk_oeb}]
set_load -pin_load 0.0177 [get_ports {flash_csb}]
set_load -pin_load 0.0177 [get_ports {flash_csb_ieb}]
set_load -pin_load 0.0177 [get_ports {flash_csb_oeb}]
set_load -pin_load 0.0177 [get_ports {flash_io0_do}]
set_load -pin_load 0.0177 [get_ports {flash_io0_ieb}]
set_load -pin_load 0.0177 [get_ports {flash_io0_oeb}]
set_load -pin_load 0.0177 [get_ports {flash_io1_do}]
set_load -pin_load 0.0177 [get_ports {flash_io1_ieb}]
set_load -pin_load 0.0177 [get_ports {flash_io1_oeb}]
set_load -pin_load 0.0177 [get_ports {flash_io2_oeb}]
set_load -pin_load 0.0177 [get_ports {flash_io3_oeb}]
set_load -pin_load 0.0177 [get_ports {gpio_inenb_pad}]
set_load -pin_load 0.0177 [get_ports {gpio_mode0_pad}]
set_load -pin_load 0.0177 [get_ports {gpio_mode1_pad}]
set_load -pin_load 0.0177 [get_ports {gpio_out_pad}]
set_load -pin_load 0.0177 [get_ports {gpio_outenb_pad}]
set_load -pin_load 0.0177 [get_ports {jtag_out}]
set_load -pin_load 0.0177 [get_ports {jtag_outenb}]
set_load -pin_load 0.0177 [get_ports {mgmt_ena_ro}]
set_load -pin_load 0.0177 [get_ports {mprj_cyc_o}]
set_load -pin_load 0.0177 [get_ports {mprj_io_loader_clock}]
set_load -pin_load 0.0177 [get_ports {mprj_io_loader_data_1}]
set_load -pin_load 0.0177 [get_ports {mprj_io_loader_data_2}]
set_load -pin_load 0.0177 [get_ports {mprj_io_loader_resetn}]
set_load -pin_load 0.0177 [get_ports {mprj_stb_o}]
set_load -pin_load 0.0177 [get_ports {mprj_we_o}]
set_load -pin_load 0.0177 [get_ports {sdo_out}]
set_load -pin_load 0.0177 [get_ports {sdo_outenb}]
set_load -pin_load 0.0177 [get_ports {user_clk}]
set_load -pin_load 0.0177 [get_ports {la_iena[127]}]
set_load -pin_load 0.0177 [get_ports {la_iena[126]}]
set_load -pin_load 0.0177 [get_ports {la_iena[125]}]
set_load -pin_load 0.0177 [get_ports {la_iena[124]}]
set_load -pin_load 0.0177 [get_ports {la_iena[123]}]
set_load -pin_load 0.0177 [get_ports {la_iena[122]}]
set_load -pin_load 0.0177 [get_ports {la_iena[121]}]
set_load -pin_load 0.0177 [get_ports {la_iena[120]}]
set_load -pin_load 0.0177 [get_ports {la_iena[119]}]
set_load -pin_load 0.0177 [get_ports {la_iena[118]}]
set_load -pin_load 0.0177 [get_ports {la_iena[117]}]
set_load -pin_load 0.0177 [get_ports {la_iena[116]}]
set_load -pin_load 0.0177 [get_ports {la_iena[115]}]
set_load -pin_load 0.0177 [get_ports {la_iena[114]}]
set_load -pin_load 0.0177 [get_ports {la_iena[113]}]
set_load -pin_load 0.0177 [get_ports {la_iena[112]}]
set_load -pin_load 0.0177 [get_ports {la_iena[111]}]
set_load -pin_load 0.0177 [get_ports {la_iena[110]}]
set_load -pin_load 0.0177 [get_ports {la_iena[109]}]
set_load -pin_load 0.0177 [get_ports {la_iena[108]}]
set_load -pin_load 0.0177 [get_ports {la_iena[107]}]
set_load -pin_load 0.0177 [get_ports {la_iena[106]}]
set_load -pin_load 0.0177 [get_ports {la_iena[105]}]
set_load -pin_load 0.0177 [get_ports {la_iena[104]}]
set_load -pin_load 0.0177 [get_ports {la_iena[103]}]
set_load -pin_load 0.0177 [get_ports {la_iena[102]}]
set_load -pin_load 0.0177 [get_ports {la_iena[101]}]
set_load -pin_load 0.0177 [get_ports {la_iena[100]}]
set_load -pin_load 0.0177 [get_ports {la_iena[99]}]
set_load -pin_load 0.0177 [get_ports {la_iena[98]}]
set_load -pin_load 0.0177 [get_ports {la_iena[97]}]
set_load -pin_load 0.0177 [get_ports {la_iena[96]}]
set_load -pin_load 0.0177 [get_ports {la_iena[95]}]
set_load -pin_load 0.0177 [get_ports {la_iena[94]}]
set_load -pin_load 0.0177 [get_ports {la_iena[93]}]
set_load -pin_load 0.0177 [get_ports {la_iena[92]}]
set_load -pin_load 0.0177 [get_ports {la_iena[91]}]
set_load -pin_load 0.0177 [get_ports {la_iena[90]}]
set_load -pin_load 0.0177 [get_ports {la_iena[89]}]
set_load -pin_load 0.0177 [get_ports {la_iena[88]}]
set_load -pin_load 0.0177 [get_ports {la_iena[87]}]
set_load -pin_load 0.0177 [get_ports {la_iena[86]}]
set_load -pin_load 0.0177 [get_ports {la_iena[85]}]
set_load -pin_load 0.0177 [get_ports {la_iena[84]}]
set_load -pin_load 0.0177 [get_ports {la_iena[83]}]
set_load -pin_load 0.0177 [get_ports {la_iena[82]}]
set_load -pin_load 0.0177 [get_ports {la_iena[81]}]
set_load -pin_load 0.0177 [get_ports {la_iena[80]}]
set_load -pin_load 0.0177 [get_ports {la_iena[79]}]
set_load -pin_load 0.0177 [get_ports {la_iena[78]}]
set_load -pin_load 0.0177 [get_ports {la_iena[77]}]
set_load -pin_load 0.0177 [get_ports {la_iena[76]}]
set_load -pin_load 0.0177 [get_ports {la_iena[75]}]
set_load -pin_load 0.0177 [get_ports {la_iena[74]}]
set_load -pin_load 0.0177 [get_ports {la_iena[73]}]
set_load -pin_load 0.0177 [get_ports {la_iena[72]}]
set_load -pin_load 0.0177 [get_ports {la_iena[71]}]
set_load -pin_load 0.0177 [get_ports {la_iena[70]}]
set_load -pin_load 0.0177 [get_ports {la_iena[69]}]
set_load -pin_load 0.0177 [get_ports {la_iena[68]}]
set_load -pin_load 0.0177 [get_ports {la_iena[67]}]
set_load -pin_load 0.0177 [get_ports {la_iena[66]}]
set_load -pin_load 0.0177 [get_ports {la_iena[65]}]
set_load -pin_load 0.0177 [get_ports {la_iena[64]}]
set_load -pin_load 0.0177 [get_ports {la_iena[63]}]
set_load -pin_load 0.0177 [get_ports {la_iena[62]}]
set_load -pin_load 0.0177 [get_ports {la_iena[61]}]
set_load -pin_load 0.0177 [get_ports {la_iena[60]}]
set_load -pin_load 0.0177 [get_ports {la_iena[59]}]
set_load -pin_load 0.0177 [get_ports {la_iena[58]}]
set_load -pin_load 0.0177 [get_ports {la_iena[57]}]
set_load -pin_load 0.0177 [get_ports {la_iena[56]}]
set_load -pin_load 0.0177 [get_ports {la_iena[55]}]
set_load -pin_load 0.0177 [get_ports {la_iena[54]}]
set_load -pin_load 0.0177 [get_ports {la_iena[53]}]
set_load -pin_load 0.0177 [get_ports {la_iena[52]}]
set_load -pin_load 0.0177 [get_ports {la_iena[51]}]
set_load -pin_load 0.0177 [get_ports {la_iena[50]}]
set_load -pin_load 0.0177 [get_ports {la_iena[49]}]
set_load -pin_load 0.0177 [get_ports {la_iena[48]}]
set_load -pin_load 0.0177 [get_ports {la_iena[47]}]
set_load -pin_load 0.0177 [get_ports {la_iena[46]}]
set_load -pin_load 0.0177 [get_ports {la_iena[45]}]
set_load -pin_load 0.0177 [get_ports {la_iena[44]}]
set_load -pin_load 0.0177 [get_ports {la_iena[43]}]
set_load -pin_load 0.0177 [get_ports {la_iena[42]}]
set_load -pin_load 0.0177 [get_ports {la_iena[41]}]
set_load -pin_load 0.0177 [get_ports {la_iena[40]}]
set_load -pin_load 0.0177 [get_ports {la_iena[39]}]
set_load -pin_load 0.0177 [get_ports {la_iena[38]}]
set_load -pin_load 0.0177 [get_ports {la_iena[37]}]
set_load -pin_load 0.0177 [get_ports {la_iena[36]}]
set_load -pin_load 0.0177 [get_ports {la_iena[35]}]
set_load -pin_load 0.0177 [get_ports {la_iena[34]}]
set_load -pin_load 0.0177 [get_ports {la_iena[33]}]
set_load -pin_load 0.0177 [get_ports {la_iena[32]}]
set_load -pin_load 0.0177 [get_ports {la_iena[31]}]
set_load -pin_load 0.0177 [get_ports {la_iena[30]}]
set_load -pin_load 0.0177 [get_ports {la_iena[29]}]
set_load -pin_load 0.0177 [get_ports {la_iena[28]}]
set_load -pin_load 0.0177 [get_ports {la_iena[27]}]
set_load -pin_load 0.0177 [get_ports {la_iena[26]}]
set_load -pin_load 0.0177 [get_ports {la_iena[25]}]
set_load -pin_load 0.0177 [get_ports {la_iena[24]}]
set_load -pin_load 0.0177 [get_ports {la_iena[23]}]
set_load -pin_load 0.0177 [get_ports {la_iena[22]}]
set_load -pin_load 0.0177 [get_ports {la_iena[21]}]
set_load -pin_load 0.0177 [get_ports {la_iena[20]}]
set_load -pin_load 0.0177 [get_ports {la_iena[19]}]
set_load -pin_load 0.0177 [get_ports {la_iena[18]}]
set_load -pin_load 0.0177 [get_ports {la_iena[17]}]
set_load -pin_load 0.0177 [get_ports {la_iena[16]}]
set_load -pin_load 0.0177 [get_ports {la_iena[15]}]
set_load -pin_load 0.0177 [get_ports {la_iena[14]}]
set_load -pin_load 0.0177 [get_ports {la_iena[13]}]
set_load -pin_load 0.0177 [get_ports {la_iena[12]}]
set_load -pin_load 0.0177 [get_ports {la_iena[11]}]
set_load -pin_load 0.0177 [get_ports {la_iena[10]}]
set_load -pin_load 0.0177 [get_ports {la_iena[9]}]
set_load -pin_load 0.0177 [get_ports {la_iena[8]}]
set_load -pin_load 0.0177 [get_ports {la_iena[7]}]
set_load -pin_load 0.0177 [get_ports {la_iena[6]}]
set_load -pin_load 0.0177 [get_ports {la_iena[5]}]
set_load -pin_load 0.0177 [get_ports {la_iena[4]}]
set_load -pin_load 0.0177 [get_ports {la_iena[3]}]
set_load -pin_load 0.0177 [get_ports {la_iena[2]}]
set_load -pin_load 0.0177 [get_ports {la_iena[1]}]
set_load -pin_load 0.0177 [get_ports {la_iena[0]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[127]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[126]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[125]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[124]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[123]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[122]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[121]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[120]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[119]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[118]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[117]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[116]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[115]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[114]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[113]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[112]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[111]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[110]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[109]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[108]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[107]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[106]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[105]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[104]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[103]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[102]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[101]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[100]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[99]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[98]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[97]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[96]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[95]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[94]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[93]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[92]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[91]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[90]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[89]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[88]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[87]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[86]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[85]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[84]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[83]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[82]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[81]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[80]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[79]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[78]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[77]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[76]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[75]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[74]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[73]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[72]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[71]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[70]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[69]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[68]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[67]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[66]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[65]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[64]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[63]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[62]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[61]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[60]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[59]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[58]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[57]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[56]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[55]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[54]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[53]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[52]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[51]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[50]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[49]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[48]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[47]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[46]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[45]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[44]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[43]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[42]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[41]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[40]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[39]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[38]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[37]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[36]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[35]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[34]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[33]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[32]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[31]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[30]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[29]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[28]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[27]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[26]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[25]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[24]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[23]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[22]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[21]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[20]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[19]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[18]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[17]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[16]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[15]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[14]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[13]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[12]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[11]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[10]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[9]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[8]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[7]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[6]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[5]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[4]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[3]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[2]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[1]}]
set_load -pin_load 0.0177 [get_ports {la_oenb[0]}]
set_load -pin_load 0.0177 [get_ports {la_output[127]}]
set_load -pin_load 0.0177 [get_ports {la_output[126]}]
set_load -pin_load 0.0177 [get_ports {la_output[125]}]
set_load -pin_load 0.0177 [get_ports {la_output[124]}]
set_load -pin_load 0.0177 [get_ports {la_output[123]}]
set_load -pin_load 0.0177 [get_ports {la_output[122]}]
set_load -pin_load 0.0177 [get_ports {la_output[121]}]
set_load -pin_load 0.0177 [get_ports {la_output[120]}]
set_load -pin_load 0.0177 [get_ports {la_output[119]}]
set_load -pin_load 0.0177 [get_ports {la_output[118]}]
set_load -pin_load 0.0177 [get_ports {la_output[117]}]
set_load -pin_load 0.0177 [get_ports {la_output[116]}]
set_load -pin_load 0.0177 [get_ports {la_output[115]}]
set_load -pin_load 0.0177 [get_ports {la_output[114]}]
set_load -pin_load 0.0177 [get_ports {la_output[113]}]
set_load -pin_load 0.0177 [get_ports {la_output[112]}]
set_load -pin_load 0.0177 [get_ports {la_output[111]}]
set_load -pin_load 0.0177 [get_ports {la_output[110]}]
set_load -pin_load 0.0177 [get_ports {la_output[109]}]
set_load -pin_load 0.0177 [get_ports {la_output[108]}]
set_load -pin_load 0.0177 [get_ports {la_output[107]}]
set_load -pin_load 0.0177 [get_ports {la_output[106]}]
set_load -pin_load 0.0177 [get_ports {la_output[105]}]
set_load -pin_load 0.0177 [get_ports {la_output[104]}]
set_load -pin_load 0.0177 [get_ports {la_output[103]}]
set_load -pin_load 0.0177 [get_ports {la_output[102]}]
set_load -pin_load 0.0177 [get_ports {la_output[101]}]
set_load -pin_load 0.0177 [get_ports {la_output[100]}]
set_load -pin_load 0.0177 [get_ports {la_output[99]}]
set_load -pin_load 0.0177 [get_ports {la_output[98]}]
set_load -pin_load 0.0177 [get_ports {la_output[97]}]
set_load -pin_load 0.0177 [get_ports {la_output[96]}]
set_load -pin_load 0.0177 [get_ports {la_output[95]}]
set_load -pin_load 0.0177 [get_ports {la_output[94]}]
set_load -pin_load 0.0177 [get_ports {la_output[93]}]
set_load -pin_load 0.0177 [get_ports {la_output[92]}]
set_load -pin_load 0.0177 [get_ports {la_output[91]}]
set_load -pin_load 0.0177 [get_ports {la_output[90]}]
set_load -pin_load 0.0177 [get_ports {la_output[89]}]
set_load -pin_load 0.0177 [get_ports {la_output[88]}]
set_load -pin_load 0.0177 [get_ports {la_output[87]}]
set_load -pin_load 0.0177 [get_ports {la_output[86]}]
set_load -pin_load 0.0177 [get_ports {la_output[85]}]
set_load -pin_load 0.0177 [get_ports {la_output[84]}]
set_load -pin_load 0.0177 [get_ports {la_output[83]}]
set_load -pin_load 0.0177 [get_ports {la_output[82]}]
set_load -pin_load 0.0177 [get_ports {la_output[81]}]
set_load -pin_load 0.0177 [get_ports {la_output[80]}]
set_load -pin_load 0.0177 [get_ports {la_output[79]}]
set_load -pin_load 0.0177 [get_ports {la_output[78]}]
set_load -pin_load 0.0177 [get_ports {la_output[77]}]
set_load -pin_load 0.0177 [get_ports {la_output[76]}]
set_load -pin_load 0.0177 [get_ports {la_output[75]}]
set_load -pin_load 0.0177 [get_ports {la_output[74]}]
set_load -pin_load 0.0177 [get_ports {la_output[73]}]
set_load -pin_load 0.0177 [get_ports {la_output[72]}]
set_load -pin_load 0.0177 [get_ports {la_output[71]}]
set_load -pin_load 0.0177 [get_ports {la_output[70]}]
set_load -pin_load 0.0177 [get_ports {la_output[69]}]
set_load -pin_load 0.0177 [get_ports {la_output[68]}]
set_load -pin_load 0.0177 [get_ports {la_output[67]}]
set_load -pin_load 0.0177 [get_ports {la_output[66]}]
set_load -pin_load 0.0177 [get_ports {la_output[65]}]
set_load -pin_load 0.0177 [get_ports {la_output[64]}]
set_load -pin_load 0.0177 [get_ports {la_output[63]}]
set_load -pin_load 0.0177 [get_ports {la_output[62]}]
set_load -pin_load 0.0177 [get_ports {la_output[61]}]
set_load -pin_load 0.0177 [get_ports {la_output[60]}]
set_load -pin_load 0.0177 [get_ports {la_output[59]}]
set_load -pin_load 0.0177 [get_ports {la_output[58]}]
set_load -pin_load 0.0177 [get_ports {la_output[57]}]
set_load -pin_load 0.0177 [get_ports {la_output[56]}]
set_load -pin_load 0.0177 [get_ports {la_output[55]}]
set_load -pin_load 0.0177 [get_ports {la_output[54]}]
set_load -pin_load 0.0177 [get_ports {la_output[53]}]
set_load -pin_load 0.0177 [get_ports {la_output[52]}]
set_load -pin_load 0.0177 [get_ports {la_output[51]}]
set_load -pin_load 0.0177 [get_ports {la_output[50]}]
set_load -pin_load 0.0177 [get_ports {la_output[49]}]
set_load -pin_load 0.0177 [get_ports {la_output[48]}]
set_load -pin_load 0.0177 [get_ports {la_output[47]}]
set_load -pin_load 0.0177 [get_ports {la_output[46]}]
set_load -pin_load 0.0177 [get_ports {la_output[45]}]
set_load -pin_load 0.0177 [get_ports {la_output[44]}]
set_load -pin_load 0.0177 [get_ports {la_output[43]}]
set_load -pin_load 0.0177 [get_ports {la_output[42]}]
set_load -pin_load 0.0177 [get_ports {la_output[41]}]
set_load -pin_load 0.0177 [get_ports {la_output[40]}]
set_load -pin_load 0.0177 [get_ports {la_output[39]}]
set_load -pin_load 0.0177 [get_ports {la_output[38]}]
set_load -pin_load 0.0177 [get_ports {la_output[37]}]
set_load -pin_load 0.0177 [get_ports {la_output[36]}]
set_load -pin_load 0.0177 [get_ports {la_output[35]}]
set_load -pin_load 0.0177 [get_ports {la_output[34]}]
set_load -pin_load 0.0177 [get_ports {la_output[33]}]
set_load -pin_load 0.0177 [get_ports {la_output[32]}]
set_load -pin_load 0.0177 [get_ports {la_output[31]}]
set_load -pin_load 0.0177 [get_ports {la_output[30]}]
set_load -pin_load 0.0177 [get_ports {la_output[29]}]
set_load -pin_load 0.0177 [get_ports {la_output[28]}]
set_load -pin_load 0.0177 [get_ports {la_output[27]}]
set_load -pin_load 0.0177 [get_ports {la_output[26]}]
set_load -pin_load 0.0177 [get_ports {la_output[25]}]
set_load -pin_load 0.0177 [get_ports {la_output[24]}]
set_load -pin_load 0.0177 [get_ports {la_output[23]}]
set_load -pin_load 0.0177 [get_ports {la_output[22]}]
set_load -pin_load 0.0177 [get_ports {la_output[21]}]
set_load -pin_load 0.0177 [get_ports {la_output[20]}]
set_load -pin_load 0.0177 [get_ports {la_output[19]}]
set_load -pin_load 0.0177 [get_ports {la_output[18]}]
set_load -pin_load 0.0177 [get_ports {la_output[17]}]
set_load -pin_load 0.0177 [get_ports {la_output[16]}]
set_load -pin_load 0.0177 [get_ports {la_output[15]}]
set_load -pin_load 0.0177 [get_ports {la_output[14]}]
set_load -pin_load 0.0177 [get_ports {la_output[13]}]
set_load -pin_load 0.0177 [get_ports {la_output[12]}]
set_load -pin_load 0.0177 [get_ports {la_output[11]}]
set_load -pin_load 0.0177 [get_ports {la_output[10]}]
set_load -pin_load 0.0177 [get_ports {la_output[9]}]
set_load -pin_load 0.0177 [get_ports {la_output[8]}]
set_load -pin_load 0.0177 [get_ports {la_output[7]}]
set_load -pin_load 0.0177 [get_ports {la_output[6]}]
set_load -pin_load 0.0177 [get_ports {la_output[5]}]
set_load -pin_load 0.0177 [get_ports {la_output[4]}]
set_load -pin_load 0.0177 [get_ports {la_output[3]}]
set_load -pin_load 0.0177 [get_ports {la_output[2]}]
set_load -pin_load 0.0177 [get_ports {la_output[1]}]
set_load -pin_load 0.0177 [get_ports {la_output[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[7]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[6]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[5]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[4]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[3]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[2]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[7]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[6]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[5]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[4]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[3]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[2]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_addr_ro[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_ena[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_ena[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[37]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[36]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[35]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[34]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[33]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[32]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[31]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[30]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[29]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[28]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[27]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[26]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[25]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[24]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[23]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[22]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[21]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[20]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[19]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[18]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[17]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[16]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[15]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[14]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[13]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[12]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[11]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[10]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[9]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[8]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[7]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[6]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[5]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[4]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[3]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[2]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_out_data[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[31]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[30]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[29]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[28]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[27]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[26]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[25]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[24]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[23]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[22]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[21]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[20]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[19]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[18]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[17]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[16]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[15]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[14]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[13]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[12]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[11]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[10]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[9]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[8]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[7]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[6]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[5]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[4]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[3]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[2]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wdata[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen[0]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[7]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[6]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[5]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[4]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[3]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[2]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[1]}]
set_load -pin_load 0.0177 [get_ports {mgmt_wen_mask[0]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[31]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[30]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[29]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[28]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[27]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[26]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[25]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[24]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[23]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[22]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[21]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[20]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[19]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[18]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[17]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[16]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[15]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[14]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[13]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[12]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[11]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[10]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[9]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[8]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[7]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[6]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[5]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[4]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[3]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[2]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[1]}]
set_load -pin_load 0.0177 [get_ports {mprj_adr_o[0]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[31]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[30]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[29]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[28]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[27]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[26]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[25]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[24]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[23]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[22]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[21]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[20]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[19]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[18]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[17]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[16]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[15]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[14]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[13]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[12]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[11]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[10]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[9]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[8]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[7]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[6]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[5]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[4]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[3]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[2]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[1]}]
set_load -pin_load 0.0177 [get_ports {mprj_dat_o[0]}]
set_load -pin_load 0.0177 [get_ports {mprj_sel_o[3]}]
set_load -pin_load 0.0177 [get_ports {mprj_sel_o[2]}]
set_load -pin_load 0.0177 [get_ports {mprj_sel_o[1]}]
set_load -pin_load 0.0177 [get_ports {mprj_sel_o[0]}]
set_load -pin_load 0.0177 [get_ports {pwr_ctrl_out[3]}]
set_load -pin_load 0.0177 [get_ports {pwr_ctrl_out[2]}]
set_load -pin_load 0.0177 [get_ports {pwr_ctrl_out[1]}]
set_load -pin_load 0.0177 [get_ports {pwr_ctrl_out[0]}]
set_load -pin_load 0.0177 [get_ports {user_irq_ena[2]}]
set_load -pin_load 0.0177 [get_ports {user_irq_ena[1]}]
set_load -pin_load 0.0177 [get_ports {user_irq_ena[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io0_di}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io1_di}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in_pad}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj2_vcc_pwrgood}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj2_vdd_pwrgood}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_ack_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_vcc_pwrgood}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_vdd_pwrgood}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {porb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[127]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[126]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[125]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[124]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[123]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[122]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[121]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[120]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[119]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[118]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[117]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[116]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[115]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[114]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[113]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[112]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[111]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[110]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[109]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[108]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[107]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[106]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[105]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[104]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[103]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[102]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[101]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[100]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[99]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[98]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[97]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[96]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[95]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[94]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[93]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[92]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[91]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[90]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[89]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[88]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[87]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[86]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[85]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[84]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[83]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[82]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[81]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[80]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[79]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[78]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[77]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[76]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[75]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[74]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[73]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[72]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[71]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[70]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[69]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[68]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[67]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[66]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[65]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[64]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mask_rev[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_in_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mgmt_rdata_ro[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_8 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 4.0000 [current_design]
